Autodesk.Revit.DB.Structure.RebarCoupler.SetUnobscuredInView(Autodesk.Revit.DB.View,System.Boolean)
Sets this rebar coupler element to be shown unobscured in a view.
view:
The view element
unobscured:
True if rebar coupler is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar coupler element doesn't have valid visibility data
Since:
2018.3

Autodesk.Revit.DB.Structure.RebarCoupler.IsUnobscuredInView(Autodesk.Revit.DB.View)
Checks if this rebar coupler element is shown unobscured in a view.
view:
The view element
Returns:
True if rebar coupler is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar coupler element doesn't have valid visibility data
Since:
2018.3

Autodesk.Revit.DB.Structure.RebarCoupler.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Structure.ReinforcementData,Autodesk.Revit.DB.Structure.ReinforcementData,Autodesk.Revit.DB.Structure.RebarCouplerError@)
Creates a new instance of a Rebar Coupler element within the project.
doc:
A document.
typeId:
type id for coupler
pFirstData:
information about the first reinforcement to be coupled
pSecondData:
information about the second reinforcement to be coupled;
if a nullptr is passed in the coupler is placed on one reinforcement
error:
will be ValidationSuccesfully(0) if ok, otherwise the failure reason
Returns:
The newly created Rebar Coupler instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.Structure.RebarCoupler.RotationAngle
Indetifies the rotation angle of the coupler around its axis.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
The rotation parameter cannot be set or get for Self-Orienting rebar coupler families ( rebar coupler families with FAMILY_SELF_ORIENTING parameter = 1 ).
Since:
2023

Autodesk.Revit.DB.Structure.RebarCoupler.CouplerMark
gets and sets the coupler mark
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017